app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "avatar_file_name", "avatar_file_size", "updated_at", "avatar_content_type", "login", "avatar_updated_at") VALUES('akita', '2010-07-27 18:06:23', '4015270661_1d44744ac4_o.jpg', 78920, '2010-07-27 18:06:23', 'image/jpeg', 'Akita', '2010-07-27 18:06:20')
---
  def create
    @user = User.create(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 10)
UPDATE "users" SET "updated_at" = '2010-07-27 19:01:48', "name" = 'Fabio ' WHERE "id" = 10
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])